app/Controllers/Todo.php

    public function index()
    {
        $status = $this->request->getVar('status');
        $search = $this->request->getVar('search');

        $query = $this->taskModel;

        if ($status) {
            $query = $query->where('status', $status);
        }
        if ($search) {
            $query = $query->like('title', $search);
        }

        $data = [
            'tasks'          => $query->orderBy('created_at', 'DESC')->findAll(),
            'current_status' => $status ?? '',
            'current_search' => $search ?? ''
        ];
---
SELECT *
FROM `tasks`
WHERE `title` LIKE '%kelompok%' ESCAPE '!'
ORDER BY `created_at` DESC

    public function create()
    {
        $title = $this->request->getPost('title');

        if (empty($title)) {
            return redirect()->back()->with('error', 'Judul tugas tidak boleh kosong!');
        }

        $this->taskModel->insert([
            'title'       => $title,
            'description' => $this->request->getPost('description'),
            'status'      => 'pending'
        ]);
---
INSERT INTO `tasks` (`title`, `description`, `status`, `created_at`, `updated_at`) VALUES ('dadw', 'daedf', 'pending', '2026-02-17 19:29:59', '2026-02-17 19:29:59')

    public function delete($id)
    {
        $this->taskModel->delete($id);
---
DELETE FROM `tasks`
WHERE `id` IN ('6')